{"id":"5677fc9d-376f-4f69-9b04-885396b03613","updated_at":"2025-06-02T20:12:58.458Z","updated_by":"elastic","created_at":"2025-06-02T20:12:58.458Z","created_by":"elastic","name":"Brute force rule","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Brute force rule","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"99999h","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-359996700s","rule_id":"21a3f60b-a638-430c-9256-2593a83c805b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"8a398a77-45ec-4b50-9f54-7d057b48e6e2","query":"program: \"login\" and auth_message: \"*authentication failure*\"","filters":[],"threshold":{"field":["hostname.keyword"],"value":5,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
